posts/2009-02-19-expectations-and-grades.org
#+date: <2009-02-19>
#+title: Expectations and Grades
#+filetags: critical-thinking

There’s an interesting piece in the [[https://www.nytimes.com/2009/02/18/education/18college.html?_r=2&amp;ref=todayspaper][New York Times]] today about student expectations and grade inflation. Apparently, there are students (at institutions other than Oklahoma Baptist, I’m sure) that believe that doing the minimal work that is required of everyone in the course should be sufficient to earn a B for the course. Either we have lowered the level of work that we are willing to consider average, or it really is true that in today’s society someone who manages to complete the minimum requirements really is above average. Either disjunct strikes me as disturbing. If you are in Critical Thinking, keep this story in mind. It is relevant to some of the topics that we will be discussing later.
    


#+begin_tagline
Tagged: critical-thinking
#+end_tagline
