docs/posts/2009-02-19-expectations-and-grades.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Apr 08, 2025 19:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Expectations and Grades</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Expectations and Grades</h1>
<p class="subtitle" role="doc-subtitle">Feb 19, 2009 00:00</p>
</header><p>
There’s an interesting piece in the <a href="https://www.nytimes.com/2009/02/18/education/18college.html?_r=2&amp;amp;ref=todayspaper">New York Times</a> today about student expectations and grade inflation. Apparently, there are students (at institutions other than Oklahoma Baptist, I’m sure) that believe that doing the minimal work that is required of everyone in the course should be sufficient to earn a B for the course. Either we have lowered the level of work that we are willing to consider average, or it really is true that in today’s society someone who manages to complete the minimum requirements really is above average. Either disjunct strikes me as disturbing. If you are in Critical Thinking, keep this story in mind. It is relevant to some of the topics that we will be discussing later.
</p>



<div class="tagline" id="org74a4376">
<p>
Tagged: <a href="../tags/critical-thinking.html">Critical-Thinking</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Apr 08, 2025 19:52.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
